server/loadtest.yaml
config:
  plugins:
    publish-metrics:
      - reportFile: './report.html'
#  target: 'https://showmethemoney.p-e.kr'
  target: 'http://localhost:3000'
  phases:
    - duration: 60 # 몇초간
      arrivalRate: 50 # 초당 생성할 가상 유저
      name: Warm up
scenarios: # 각 가상 유저가 실행할 작업(밀도)
  - name: User logs in and makes authenticated request
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: "daechan476@gmail.com"
            password: "1234"
          capture:
            json: '$.token'
            as: 'authToken'
      - get:
          url: '/api/user/list-all'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - get:
          url: '/api/user/list?search=random'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - get:
          url : '/api/user/list?search=sponsor'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - get:
          url : '/api/user/list?search=sponsored'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - get:
          url : '/api/user/list?search=allSponsored'
          headers:
            Authorization: 'Bearer {{ authToken }}'

# artillery run --output test-run-report.json loadtest.yaml
# artillery report test-run-report.json